Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: TablePro could not do this for you. Run this in Terminal instead:
fr: TablePro ne pouvait pas faire cela pour vous. Exécutez-le au lieu-de cela dans le terminal :
ko: TablePro가 이 작업을 수행할 수 없습니다. 대신 터미널에서 다음을 실행하십시오:
tr: TablePro bunu sizin için yapamadı. Bunun yerine Terminal'de şunu çalıştırın:
vi: TablePro không thể làm việc này giúp bạn. Hãy chạy lệnh sau trong Terminal:
zh_hans: TablePro 无法替你完成此操作。请在终端中运行：
zh_hant: TablePro 無法替你完成此操作。請改在終端機執行：

source: Updating this plugin didn't finish. TablePro will try again the next time it launches.
fr: La mise à jour de ce plugin n'a pas été terminée. TablePro réessayera la prochaine fois qu'il sera lancé.
ko: 이 플러그인의 업데이트가 완료되지 않았습니다. 다음에 TablePro를 실행할 때 다시 시도합니다.
tr: Bu eklentinin güncellenmesi tamamlanmadı. TablePro bir sonraki açılışta yeniden deneyecek.
vi: Cập nhật plugin này chưa hoàn tất. TablePro sẽ thử lại lần khởi động tiếp theo.
zh_hans: 此插件更新未完成。TablePro 将在下次启动时重试。
zh_hant: 此外掛的更新尚未完成。TablePro 會在下次啟動時重試。

# %@ is already used by "%@" in %@. Reassigning removes it from that action.
source: %1$@ is already used by "%2$@" in %3$@. Reassigning removes it from that action.
fr: %1$@ est déjà utilisé par "%2$@" dans %3$@. La réaffectation le retire de cette action.
ko: %1$@ 키는 이미 "%2$@" 동작(%3$@)에서 사용 중입니다. 다시 할당하면 해당 동작에서 제거됩니다.
tr: %1$@ zaten %3$@ içindeki "%2$@" tarafından kullanılıyor. Yeniden atamak onu o eylemden kaldırır.
vi: %1$@ đang được dùng bởi "%2$@" trong %3$@. Gán lại sẽ gỡ nó khỏi thao tác đó.
zh_hans: %1$@已被%3$@中的"%2$@"使用。重新指定会将其从该操作中移除。
zh_hant: %1$@ 已被 %2$@ 中的「%3$@」使用。重新指派會將它從該動作中移除。

source: exclamation mark
fr: point d'exclamation
ko: 느낌표
tr: ünlem işareti
vi: dấu chấm than
zh_hans: 感叹号
zh_hant: 驚嘆號

source: Revoke
fr: Révoquer
ko: 철회
tr: İptal Et
vi: Thu hồi
zh_hans: 撤销
zh_hant: 撤銷

source: Finished
fr: Terminé
ko: 완료됨
tr: Bitti
vi: Đã xong
zh_hans: 已完成
zh_hant: 已完成

source: The file or its staged version changed before it could be written. Nothing was replaced.
fr: Le fichier ou sa version modifiée a changé avant qu'il ne puisse être écrit. Rien n'a été remplacé.

# Export %lld table(s) to %@
source: Export %1$lld table(s) to %2$@
fr: Exporter %1$lld table(s) vers %2$@
ko: %1$lld개 테이블을 %2$@(으)로 내보내기
tr: %lld tabloyu %@ olarak dışa aktar
vi: Export %lld bảng sang %@
zh_hans: 导出 %lld 张表到 %@
zh_hant: 匯出 %1$lld 個資料表至 %2$@

source: Discard Changes
fr: Jeter les modifications

source: Restore Dump Complete
fr: Restaurer le déversement complet
ko: 덤프 복원 완료
tr: Döküm Geri Yükleme Tamamlandı
vi: Khôi phục dump hoàn tất
zh_hans: 转储恢复完成
zh_hant: 還原備份完成

source: Connection not found
fr: Connexion non trouvée
ko: 연결을 찾을 수 없습니다
tr: Bağlantı bulunamadı
vi: Không tìm thấy kết nối
zh_hans: 未找到连接
zh_hant: 找不到連線

source: Edit View Definition
fr: Modifier la définition de la vue
ko: 뷰 정의 편집
tr: Görünüm Tanımını Düzenle
vi: Sửa định nghĩa view
zh_hans: 编辑视图定义
zh_hant: 編輯檢視表定義

source: %@ cannot have indexes.
fr: %@ ne peut pas avoir d’index.

source: Kerberos authentication failed: %@
fr: L'authentification Kerberos a échoué : %@
ko: Kerberos 인증 실패: %@
tr: Kerberos kimlik doğrulaması başarısız: %@
vi: Xác thực Kerberos thất bại: %@
zh_hans: Kerberos 认证失败：%@
zh_hant: Kerberos 驗證失敗：%@

source: Metric
fr: Métrique
ko: 지표
tr: Metrik
vi: Chỉ số
zh_hans: 指标
zh_hant: 指標

source: No models loaded
fr: Aucun modèle n'est chargé
ko: 불러온 모델 없음
vi: Chưa tải mô hình nào
zh_hans: 未加载模型
zh_hant: 未載入模型

source: The file changed while the operation ran, so nothing was applied.
fr: Le fichier a changé pendant que l'opération se déroulait, donc rien n'a été appliqué.

source: None
fr: Aucun
ko: 없음
vi: Không
zh_hans: 无
zh_hant: 無

source: Sponsor
fr: Parrain
ko: 후원
vi: Tài trợ
zh_hans: 赞助
zh_hant: 贊助

source: Connect over private IP
fr: Se connecter via un IP privé
ko: 비공개 IP로 연결
tr: Özel IP üzerinden bağlan
vi: Kết nối qua IP riêng
zh_hans: 通过专用 IP 连接
zh_hant: 透過專用 IP 連線

source: Verify server certificate
fr: Vérifier le certificat du serveur
ko: 서버 인증서 확인
tr: Sunucu sertifikasını doğrula
vi: Xác minh chứng chỉ máy chủ
zh_hans: 验证服务器证书
zh_hant: 驗證伺服器憑證

source: Mean
fr: Méchant

source: Enter your license key to unlock Pro features.
fr: Entrez votre clé de licence pour déverrouiller les fonctionnalités Pro.
ko: Pro 기능을 잠금 해제하려면 라이선스 키를 입력하십시오.
tr: Pro özelliklerin kilidini açmak için lisans anahtarınızı girin.
vi: Nhập mã giấy phép để mở khoá các tính năng Pro.
zh_hans: 输入许可证密钥以解锁 Pro 功能。
zh_hant: 輸入授權金鑰以解鎖 Pro 功能。

source: Schema the statement ran against
fr: Schéma de la déclaration contre laquelle la déclaration a été exécutée
ko: 명령문이 실행된 스키마
tr: İfadenin karşı çalıştığı şema
vi: Schema mà câu lệnh đã chạy trên đó
zh_hans: 该语句所针对的 Schema
zh_hant: 該陳述式所針對的綱要

source: %d plugins could not be loaded.
fr: %d plugins n'ont pas pu être chargés.
ko: %d개 플러그인을 불러올 수 없습니다.
tr: %d eklenti yüklenemedi.
vi: Không thể tải %d plugin.
zh_hans: %d个插件无法加载。
zh_hant: %d 個外掛無法載入。

source: New Query Tab (⌘T)
fr: Nouvelle onglet de requête (⌘T)
ko: 새 쿼리 탭 (⌘T)
tr: Yeni Sorgu Sekmesi (⌘T)
vi: Tab truy vấn mới (⌘T)
zh_hans: 新建查询标签页 (⌘T)
zh_hant: 新增查詢分頁 (⌘T)

source: SSH User
fr: Utilisateur SSH
ko: SSH 사용자
vi: Người dùng SSH
zh_hans: SSH 用户
zh_hant: SSH 使用者

source: All columns visible
fr: Toutes les colonnes visibles
ko: 모든 열 표시 중
tr: Tüm sütunlar görünür
vi: Hiện tất cả cột
zh_hans: 显示所有列
zh_hant: 顯示所有欄

source: You have no saved queries to publish.
fr: Vous n'avez pas de requêtes enregistrées à publier.
ko: 게시할 저장된 쿼리가 없습니다.
tr: Yayınlanacak kayıtlı sorgunuz yok.
vi: Bạn không có truy vấn đã lưu nào để xuất bản.
zh_hans: 你没有可发布的已保存查询。
zh_hant: 你沒有可發佈的已儲存查詢。

source: Select a row to see its fields
fr: Sélectionnez une ligne pour voir ses champs.

source: Default collation
fr: Classification par défaut
ko: 기본 콜레이션
tr: Varsayılan karşılaştırma kuralı
vi: Collation mặc định
zh_hans: 默认排序规则
zh_hant: 預設定序

source: Automatically check for updates
fr: Vérifier automatiquement les mises à jour
ko: 업데이트 자동 확인
tr: Güncellemeleri otomatik kontrol et
vi: Tự động kiểm tra cập nhật
zh_hans: 自动检查更新
zh_hant: 自動檢查更新

source: The destructive statement to run
fr: La déclaration destructrice à exécuter
ko: 실행할 파괴적인 명령문
tr: Çalıştırılacak yıkıcı ifade
vi: Câu lệnh có tính phá huỷ cần chạy
zh_hans: 要运行的破坏性语句
zh_hant: 要執行的破壞性陳述式

source: This file cannot be saved in that format.
fr: Ce fichier ne peut pas être sauvegardé dans ce format.

source: A connection can use only one connection method at a time. Enabled: %@.
fr: Une connexion ne peut utiliser qu'un seul mode de connexion à la fois. Activé : %@.
ko: 한 연결에서는 한 번에 하나의 연결 방식만 사용할 수 있습니다. 활성화됨: %@.
tr: Bir bağlantı aynı anda yalnızca bir bağlantı yöntemi kullanabilir. Etkin: %@.
vi: Mỗi kết nối chỉ dùng được một phương thức kết nối tại một thời điểm. Đang bật: %@.
zh_hans: 一个连接同时只能使用一种连接方式。已启用：%@。
zh_hant: 一個連線同時只能使用一種連線方式。已啟用：%@。

source: Drop %1$@ "%2$@"
fr: Déposer %1$@ "%2$@"

source: “%@” owns database objects
fr: «%@» possède des objets de base de données
ko: 데이터베이스 객체의 소유자는 “%@”입니다
tr: “%@” veritabanı nesnelerinin sahibi
vi: “%@” đang sở hữu các đối tượng cơ sở dữ liệu
zh_hans: “%@” 拥有数据库对象
zh_hant: 「%@」擁有資料庫物件

source: Outcome
fr: Résultat
ko: 결과
tr: Sonuç
vi: Kết quả
zh_hans: 结果
zh_hant: 結果

source: No foreign tables
fr: Pas de tables étrangères
ko: 외부 테이블 없음
tr: Yabancı tablo yok
vi: Không có bảng ngoại
zh_hans: 没有外部表
zh_hant: 沒有外部資料表

source: A map needs a geometry or geography column. This result has none.
fr: Une carte a besoin d'une colonne de géométrie ou de géographie. Ce résultat n'en a pas.

source: Insert Column Right
fr: Insérer la colonne à droite
ko: 오른쪽에 열 삽입
tr: Sağa Sütun Ekle
vi: Chèn cột bên phải
zh_hans: 在右侧插入列
zh_hant: 在右方插入欄位

source: High
fr: Haut
ko: 높음
tr: Yüksek
vi: Cao
zh_hans: 高
zh_hant: 高

source: %@ lists a collection's fields from a sample of its documents, so structures can be compared but no script is generated.
fr: %@ liste les champs d'une collection à partir d'un échantillon de ses documents, de sorte que les structures peuvent être comparées, mais aucun script n'est généré.

source: Key pattern
fr: Motif clé
ko: 키 패턴
tr: Anahtar deseni
vi: Mẫu khóa
zh_hans: 键模式
zh_hant: 鍵模式

source: Foreign key must have at least one column, a referenced table, and a referenced column
fr: La clé étrangère doit comporter au moins une colonne, une table référencée et une colonne référencée.

source: MySQL, PostgreSQL, SQLite, ClickHouse, and Redis are built in. Others install when you choose them.
fr: MySQL, PostgreSQL, SQLite, ClickHouse et Redis sont intégrés. D'autres sont installés lorsque vous les choisissez.
ko: MySQL, PostgreSQL, SQLite, ClickHouse, Redis가 기본 포함되어 있습니다. 다른 데이터베이스는 선택할 때 설치됩니다.
tr: MySQL, PostgreSQL, SQLite, ClickHouse ve Redis yerleşik gelir. Diğerleri seçtiğinizde yüklenir.
vi: MySQL, PostgreSQL, SQLite, ClickHouse và Redis có sẵn. Các loại khác được cài khi bạn chọn chúng.
zh_hans: 内置 MySQL、PostgreSQL、SQLite、ClickHouse 和 Redis。其他数据库在你选择时安装。
zh_hant: 內建 MySQL、PostgreSQL、SQLite、ClickHouse 和 Redis。其他資料庫在你選擇時安裝。

source: Show All Databases
fr: Afficher toutes les bases de données
ko: 모든 데이터베이스 보기
tr: Tüm Veritabanlarını Göster
vi: Hiển thị tất cả cơ sở dữ liệu
zh_hans: 显示所有数据库
zh_hant: 顯示所有資料庫

source: Open Any Table by Name
fr: Ouvrir n'importe quelle table par nom
ko: 이름으로 테이블 열기
tr: Herhangi Bir Tabloyu Adıyla Açın
vi: Mở bất kỳ bảng nào theo tên
zh_hans: 按名称打开任意表格
zh_hant: 依名稱開啟任何表格

source: “%@” is still in use
fr: «%@» est toujours utilisé

source: Your database schema and query data will be sent to the AI provider for analysis. Allow for this connection?
fr: Votre schéma de base de données et vos données de requête seront envoyés au fournisseur d'IA pour analyse. Autorisez-vous cette connexion ?
ko: 분석을 위해 데이터베이스 스키마와 쿼리 데이터가 AI 제공업체로 전송됩니다. 이 연결에 대해 허용하시겠습니까?
tr: Veritabanı şemanız ve sorgu verileriniz analiz için yapay zeka sağlayıcısına gönderilecek. Bu bağlantı için izin verilsin mi?
vi: Lược đồ cơ sở dữ liệu và dữ liệu truy vấn sẽ được gửi đến nhà cung cấp AI để phân tích. Cho phép kết nối này?
zh_hans: 您的数据库结构和查询数据将被发送给 AI 提供商进行分析。是否允许此连接？
zh_hant: 你的資料庫綱要與查詢資料將傳送給 AI 供應商進行分析。要允許此連線嗎？

source: My Queries Only
fr: Seuls mes demandes
ko: 내 쿼리만
tr: Yalnızca Sorgularım
vi: Chỉ truy vấn của tôi
zh_hans: 仅我的查询
zh_hant: 僅我的查詢

source: Extra High
fr: Extra haut
ko: 매우 높음
tr: Çok Yüksek
vi: Cực cao
zh_hans: 超高
zh_hant: 超高

source: Create New Group…
fr: Créer un nouveau groupe...
ko: 새 그룹 생성…
tr: Yeni Grup Oluştur…
vi: Tạo nhóm mới…
zh_hans: 创建新分组…
zh_hant: 建立新群組…

source: Create new database
fr: Créer une nouvelle base de données
ko: 새 데이터베이스 생성
tr: Yeni veritabanı oluştur
vi: Tạo cơ sở dữ liệu mới
zh_hans: 创建新数据库
zh_hant: 建立新資料庫

source: Delete Word Backward
fr: Supprimer le mot en arrière
ko: 이전 단어 삭제
tr: Önceki Kelimeyi Sil
vi: Xoá từ liền trước
zh_hans: 删除前一个单词
zh_hant: 刪除前一個單字

source: Showing the first %@ series
fr: Affichage de la première série %@
ko: 처음 %@개 계열을 표시 중
tr: İlk %@ seri gösteriliyor
vi: Đang hiển thị %@ chuỗi đầu tiên
zh_hans: 显示前 %@ 个系列
zh_hant: 顯示前 %@ 個系列

source: Operation names, sorted
fr: Noms des opérations, triés
ko: 정렬된 작업 이름
tr: İşlem adları, sıralı
vi: Tên các thao tác, đã sắp xếp
zh_hans: 已排序的操作名称
zh_hant: 已排序的作業名稱

source: AWS rejected the request signature because this Mac's clock is too far off. Check Date & Time in System Settings.
fr: AWS a rejeté la signature de la demande car l'horloge de ce Mac est trop décalée. Vérifiez la date et l'heure dans les paramètres système.

source: Current Query
fr: Requête actuelle
ko: 현재 쿼리
tr: Geçerli Sorgu
vi: Truy vấn hiện tại
zh_hans: 当前查询
zh_hant: 目前查詢

source: Inline SQL suggestions appear as you type. Press Tab to accept, Escape to dismiss.
fr: Les suggestions SQL en ligne apparaissent au fur et à mesure que vous tapez. Appuyez sur Tab pour accepter, Esc pour annuler.
ko: 입력하는 동안 인라인 SQL 제안이 표시됩니다. Tab 키를 누르면 수락하고 Escape 키를 누르면 닫습니다.
tr: Satır içi SQL önerileri yazarken görünür. Kabul etmek için Tab, kapatmak için Escape tuşuna basın.
vi: Gợi ý SQL nội tuyến hiện ra khi bạn gõ. Nhấn Tab để chấp nhận, Esc để bỏ qua.
zh_hans: 内联 SQL 建议会在输入时出现。按 Tab 接受，按 Esc 取消。
zh_hant: 行內 SQL 建議會在輸入時出現。按 Tab 接受，按 Esc 關閉。

source: Duration in milliseconds
fr: Durée en millisecondes
ko: 밀리초 단위 소요 시간
tr: Milisaniye cinsinden süre
vi: Thời lượng tính bằng mili giây
zh_hans: 以毫秒计的时长
zh_hant: 以毫秒計的時長

source: The Codex CLI login could not be read.
fr: La connexion au CLI du Codex n'a pas pu être lu.
ko: Codex CLI 로그인을 읽을 수 없습니다.
tr: Codex CLI girişi okunamadı.
vi: Không thể đọc đăng nhập Codex CLI.
zh_hans: 无法读取 Codex CLI 登录。
zh_hant: 無法讀取 Codex CLI 登入。

source: Watch shared folders for connection files.
fr: Surveillez les dossiers partagés pour les fichiers de connexion.
ko: 공유 폴더에서 연결 파일을 감시합니다.
tr: Paylaşılan klasörleri bağlantı dosyaları için izleyin.
vi: Theo dõi thư mục chia sẻ để tìm tệp kết nối.
zh_hans: 监视共享文件夹中的连接文件。
zh_hant: 監看共用資料夾中的連線檔案。

source: The pairing verifier is malformed.
fr: Le vérificateur de jumelage est mal formé.
ko: 페어링 검증자의 형식이 잘못되었습니다.
tr: Eşleştirme doğrulayıcısı hatalı biçimlendirilmiş.
vi: Verifier ghép nối bị sai định dạng.
zh_hans: 配对验证串格式不正确。
zh_hant: 配對驗證串格式不正確。

source: Open Schema Switcher…
fr: Ouvrir le commutateur de schémas...

source: Show Row as JSON
fr: Afficher la ligne sous forme JSON

source: Session Token
fr: Token de session
ko: 세션 토큰

source: The target keeps what it has and the object is left out.
fr: La cible garde ce qu'elle a et l'objet est laissé de côté.

source: User
fr: Utilisateur
ko: 사용자
tr: Kullanıcı
vi: Người dùng
zh_hans: 用户
zh_hant: 使用者

source: Activate License…
fr: Activer la licence...
ko: 라이선스 활성화…
tr: Lisansı Etkinleştir…
vi: Kích hoạt giấy phép…
zh_hans: 激活许可证…
zh_hant: 啟用授權…

source: Missing value for parameter: %@
fr: Valeur manquante pour le paramètre : %@
ko: 매개변수 값 누락: %@
tr: Parametre için değer eksik: %@
vi: Thiếu giá trị cho tham số: %@
zh_hans: 参数缺少值：%@
zh_hant: 參數缺少值：%@

source: Last query took %@
fr: La dernière requête a pris %@
ko: 마지막 쿼리 소요 시간: %@
tr: Son sorgu %@ sürdü
vi: Truy vấn trước mất %@
zh_hans: 上次查询耗时 %@
zh_hant: 上次查詢耗時 %@

source: Destructive operations are not permitted for this client
fr: Les opérations destructrices ne sont pas autorisées pour ce client.
ko: 이 클라이언트에서는 파괴적 작업이 허용되지 않습니다
tr: Bu istemci için yıkıcı işlemlere izin verilmiyor
vi: Client này không được phép thực hiện thao tác phá hủy
zh_hans: 此客户端不允许执行破坏性操作
zh_hant: 此用戶端不允許執行破壞性操作

source: Import Data
fr: Importer des données
ko: 데이터 가져오기
tr: Veriyi İçe Aktar
vi: Nhập dữ liệu
zh_hans: 导入数据
zh_hant: 匯入資料

source: Pending changes reach more than one database. Save or discard one database at a time.
fr: Les changements en attente atteignent plus d'une base de données. Enregistrez ou rejetez une base de données à la fois.
ko: 대기 중인 변경 사항이 여러 데이터베이스에 걸쳐 있습니다. 데이터베이스별로 하나씩 저장하거나 버리십시오.
tr: Bekleyen değişiklikler birden fazla veritabanına uzanıyor. Her seferinde tek bir veritabanını kaydedin veya değişikliklerini atın.
vi: Các thay đổi đang chờ trải trên nhiều cơ sở dữ liệu. Hãy lưu hoặc huỷ từng cơ sở dữ liệu một.
zh_hans: 待处理的更改涉及多个数据库。请一次保存或放弃一个数据库。
zh_hant: 待處理的變更涉及多個資料庫。請一次儲存或捨棄一個資料庫。

source: Change password for %@
fr: Changer le mot de passe pour %@
ko: %@ 암호 변경
tr: %@ için parolayı değiştir
vi: Đổi mật khẩu cho %@
zh_hans: 更改 %@ 的密码
zh_hant: 更改 %@ 的密碼

# %lld in, %lld out
source: %1$lld in, %2$lld out
fr: %1$lld entré, %2$lld sorti

source: One SQL or NoSQL statement
fr: Une seule instruction SQL ou NoSQL
ko: SQL 또는 NoSQL 명령문 하나
tr: Tek bir SQL veya NoSQL ifadesi
vi: Một câu lệnh SQL hoặc NoSQL
zh_hans: 一条 SQL 或 NoSQL 语句
zh_hant: 一條 SQL 或 NoSQL 陳述式

source: Read-only database
fr: Base de données en lecture seule

source: Checking for the Claude Code command line tool…
fr: Vérification de l'outil de ligne de commande Claude Code...
ko: Claude Code 명령줄 도구 확인 중…
tr: Claude Code komut satırı aracı denetleniyor…
vi: Đang kiểm tra công cụ dòng lệnh Claude Code…
zh_hans: 正在检查 Claude Code 命令行工具…
zh_hant: 正在檢查 Claude Code 命令列工具…

source: Database Drivers
fr: Pilotes de base de données
ko: 데이터베이스 드라이버
tr: Veritabanı Sürücüleri
vi: Trình điều khiển cơ sở dữ liệu
zh_hans: 数据库驱动
zh_hant: 資料庫驅動程式

source: %@ Preview
fr: %@ Aperçu
ko: %@ 미리보기
tr: %@ Önizleme
vi: Xem trước %@
zh_hans: %@ 预览
zh_hant: %@ 預覽

source: Publish to Team Library…
fr: Publier dans la bibliothèque de l'équipe...
ko: 팀 라이브러리에 게시…
tr: Takım Kitaplığına Yayınla…
vi: Xuất bản lên thư viện nhóm…
zh_hans: 发布到团队库…
zh_hant: 發佈到團隊庫…

source: %@ does not accept this column change.
fr: %@ n'accepte pas ce changement de colonne.

# Tool %@ on the MCP server %@.
source: Tool %1$@ on the MCP server %2$@.
fr: Outil %1$@ sur le serveur MCP %2$@.

source: This license has expired. Renew it to continue using Pro features.
fr: Cette licence a expiré. Rénouvelez-la pour continuer à utiliser les fonctionnalités Pro.
ko: 이 라이선스는 만료되었습니다. Pro 기능을 계속 사용하려면 갱신하십시오.
tr: Bu lisansın süresi doldu. Pro özellikleri kullanmaya devam etmek için yenileyin.
vi: Giấy phép này đã hết hạn. Gia hạn để tiếp tục sử dụng các tính năng Pro.
zh_hans: 此许可证已过期。请续期以继续使用 Pro 功能。
zh_hant: 此授權已過期。請續訂以繼續使用 Pro 功能。

source: Semicolon ;
fr: Point-virgule ;
ko: 세미콜론 ;
tr: Noktalı Virgül ;
vi: Dấu chấm phẩy ;
zh_hans: 分号 ;
zh_hant: 分號 ;

source: No Matching Connections
fr: Aucune connexion correspondante
ko: 일치하는 연결 없음
tr: Eşleşen Bağlantı Yok
vi: Không có kết nối phù hợp
zh_hans: 无匹配连接
zh_hant: 無符合的連線

source: This plugin requires TablePro %@ or later
fr: Ce plugin nécessite TablePro %@ ou plus récent.
ko: 이 플러그인에는 TablePro %@ 이상이 필요합니다
tr: Bu eklenti TablePro %@ veya sonrasını gerektiriyor
vi: Plugin này yêu cầu TablePro %@ trở lên
zh_hans: 此插件需要 TablePro %@ 或更高版本
zh_hant: 此外掛需要 TablePro %@ 或更新版本

source: The server no longer knows this license key.
fr: Le serveur ne connaît plus cette clé de licence.
ko: 서버가 이 라이선스 키를 더 이상 알지 못합니다.
tr: Sunucu bu lisans anahtarını artık tanımıyor.
vi: Máy chủ không còn nhận ra khóa giấy phép này.
zh_hans: 服务器已不再识别此许可证密钥。
zh_hant: 伺服器已不再識別此授權金鑰。

# Compared %@. %d differences.
source: Compared %1$@. %2$d differences.
fr: Comparé %1$@. %2$d différences.

source: Untracked
fr: Non suivi

source: There is no import format for “%@”.
fr: Il n'y a pas de format d'importation pour "%@".

source: Raw SQL filters are not available over MCP.
fr: Les filtres SQL bruts ne sont pas disponibles via MCP.
ko: 원시 SQL 필터는 MCP를 통해 사용할 수 없습니다.
tr: Ham SQL filtreleri MCP üzerinden kullanılamaz.
vi: Bộ lọc SQL thô không dùng được qua MCP.
zh_hans: 原始 SQL 筛选条件无法通过 MCP 使用。
zh_hant: 原始 SQL 篩選條件無法透過 MCP 使用。

source: Filter by text or /regex/
fr: Filtre par texte ou /regex/

source: Enter the TOTP verification code for SSH authentication.
fr: Entrez le code de vérification TOTP pour l'authentification SSH.
ko: SSH 인증용 TOTP 확인 코드를 입력하십시오.
tr: SSH kimlik doğrulaması için TOTP doğrulama kodunu girin.
vi: Nhập mã xác minh TOTP để xác thực SSH.
zh_hans: 输入 TOTP 验证码以进行 SSH 身份验证。
zh_hant: 輸入 TOTP 驗證碼以進行 SSH 驗證。

source: Server host
fr: Serveur hôte
ko: 서버 호스트
tr: Sunucu ana makinesi
vi: Host máy chủ
zh_hans: 服务器主机
zh_hant: 伺服器主機

source: Help
fr: Aide
ko: 도움말
tr: Yardım
vi: Trợ giúp
zh_hans: 帮助
zh_hant: 輔助說明

source: Database to read. Uses the connection's current database when omitted
fr: Base de données à lire. Utilise la base de données actuelle de la connexion lorsque celle-ci est omise.
ko: 읽을 데이터베이스입니다. 생략하면 연결의 현재 데이터베이스를 사용합니다
tr: Okunacak veritabanı. Boş bırakıldığında bağlantının geçerli veritabanını kullanır
vi: Cơ sở dữ liệu cần đọc. Bỏ trống thì dùng cơ sở dữ liệu hiện tại của kết nối
zh_hans: 要读取的数据库。省略时使用该连接的当前数据库
zh_hant: 要讀取的資料庫。省略時使用該連線的目前資料庫

source: Database it lives in
fr: Base de données dans laquelle il vit
ko: 속해 있는 데이터베이스
tr: İçinde bulunduğu veritabanı
vi: Cơ sở dữ liệu chứa nó
zh_hans: 它所在的数据库
zh_hant: 它所在的資料庫

source: Manage Connections
fr: Gérer les connexions
ko: 연결 관리
tr: Bağlantıları Yönet
vi: Quản lý kết nối
zh_hans: 管理连接
zh_hant: 管理連線

source: Delete Profile
fr: Supprimer le profil
ko: 프로필 삭제
tr: Profili Sil
vi: Xoá hồ sơ
zh_hans: 删除配置
zh_hant: 刪除設定檔

# Row %lld, column %lld: %@
source: Row %1$lld, column %2$lld: %3$@
fr: Rang %1$lld, colonne %2$lld : %3$@
ko: %1$lld행, %2$lld열: %3$@
tr: satır %lld, column %lld: %@
vi: Hàng %lld, cột %lld: %@
zh_hans: 行 %lld，列 %lld：%@
zh_hant: 第 %1$lld 列，第 %2$lld 欄：%3$@

source: Query Execution Failed
fr: Échec de l'exécution de la requ
ko: 쿼리 실행 실패
tr: Sorgu Çalıştırma Başarısız
vi: Thực thi truy vấn thất bại
zh_hans: 查询执行失败
zh_hant: 查詢執行失敗

source: Turn the plugin on to connect.
fr: Activez le plugin pour vous connecter.

source: Preview MQL
fr: Aperçu MQL
ko: MQL 미리보기
vi: Xem trước MQL
zh_hans: 预览 MQL
zh_hant: 預覽 MQL

source: Focus Results
fr: Résultats de la concentration

source: A materialized view
fr: Une vue matérialisée

source: Toggle Filters (⌘F)
fr: Changer les filtres (⌘F)
ko: 필터 표시/숨기기(⌘F)
vi: Bật/tắt bộ lọc (⌘F)
zh_hans: 切换筛选 (⌘F)
zh_hant: 切換篩選 (⌘F)

source: Clipboard is empty or contains no text data.
fr: Le presse-papiers est vide ou ne contient pas de données de texte.
ko: 클립보드가 비어 있거나 텍스트 데이터가 없습니다.
tr: Pano boş veya metin verisi içermiyor.
vi: Bộ nhớ tạm trống hoặc không chứa dữ liệu văn bản.
zh_hans: 剪贴板为空或不包含文本数据。
zh_hant: 剪貼簿為空白或不包含文字資料。

source: MCP query execution
fr: Exécution de la requête MCP
ko: MCP 쿼리 실행
tr: MCP sorgu çalıştırma
vi: Thực thi truy vấn MCP
zh_hans: MCP 查询执行
zh_hant: MCP 查詢執行

source: Compare & Sync
fr: Comparer et synchroniser
ko: 비교 및 동기화
tr: Karşılaştır ve Eşitle
vi: So sánh & Đồng bộ
zh_hans: 比较与同步
zh_hant: 比較與同步

source: Table Info
fr: Informations sur la table
ko: 테이블 정보
vi: Thông tin bảng
zh_hans: 表信息
zh_hant: 資料表資訊

source: Check Again
fr: Vérifier à nouveau
ko: 다시 확인
tr: Yeniden Denetle
vi: Kiểm tra lại
zh_hans: 再次检查
zh_hant: 再次檢查

# Row %d, column %d: %@, highlighted where %@
source: Row %1$d, column %2$d: %3$@, highlighted where %4$@
fr: Rang %1$d, colonne %2$d : %3$@, mis en évidence là où %4$@

source: Comparison cancelled.
fr: Comparaison annulée.
ko: 비교가 취소되었습니다.
tr: Karşılaştırma iptal edildi.
vi: Đã hủy so sánh.
zh_hans: 已取消比较。
zh_hant: 已取消比較。

source: linked file
fr: Fichier lié
ko: 연결된 파일
tr: bağlı dosya
vi: tệp liên kết
zh_hans: 链接的文件
zh_hant: 已連結的檔案

source: The tunnel command did not open its local port in time: %@
fr: La commande du tunnel n'a pas ouvert son port local à temps : %@

source: Delete Credential Profile?
fr: Supprimer le profil de vos identifiants ?

source: Connect timeout must be between 1 and 600 seconds.
fr: Le délai de connexion doit être compris entre 1 et 600 secondes.

source: Drop %1$lld %2$@
fr: Déposer %1$lld %2$@
ko: %1$lld개의 %2$@ 삭제
tr: %1$lld %2$@ Sil
vi: Xoá %1$lld %2$@
zh_hans: 删除 %1$lld 个%2$@
zh_hant: 刪除 %1$lld 個%2$@

source: Explain a table
fr: Expliquez un tableau
ko: 테이블 설명
tr: Bir tabloyu açıkla
vi: Giải thích một bảng
zh_hans: 讲解一张表
zh_hant: 講解一張資料表

source: Formatted duration
fr: Durée formatée
ko: 형식이 적용된 소요 시간
tr: Biçimlendirilmiş süre
vi: Thời lượng đã định dạng
zh_hans: 已格式化的时长
zh_hant: 已格式化的時長

source: Relaunch Failed
fr: Le relancement a échoué.
ko: 재실행 실패
tr: Yeniden Başlatma Başarısız
vi: Mở lại thất bại
zh_hans: 重新启动失败
zh_hant: 重新啟動失敗

source: Recent Conversations
fr: Conversations récentes
ko: 최근 대화
tr: Son Konuşmalar
vi: Cuộc trò chuyện gần đây
zh_hans: 最近的会话
zh_hant: 最近的對話

source: Paste Cells
fr: Coller des cellules
ko: 셀 붙여넣기
tr: Hücreleri Yapıştır
vi: Dán ô
zh_hans: 粘贴单元格
zh_hant: 貼上儲存格

source: TablePro's MCP server has too many open connections.
fr: Le serveur MCP de TablePro a trop de connexions ouvertes.
ko: TablePro의 MCP 서버에 열린 연결이 너무 많습니다.
tr: TablePro'nun MCP sunucusunda çok fazla açık bağlantı var.
vi: Máy chủ MCP của TablePro có quá nhiều kết nối đang mở.
zh_hans: TablePro 的 MCP 服务器打开的连接过多。
zh_hant: TablePro 的 MCP 伺服器開啟的連線過多。
